# ﻿Лабораторная работа №2. Работа с файлами.

Разработать программу, которая реализует обработку текста большого объема.

На вход программе подается два параметра:

 1. Конфигурационный файл. В нем содержатся слова (вместо слова может содержаться целое предложение), которые в процессе обработки текста необходимо удалить. Удаление может быть как полным (удаление из всего текста), так из с заданным условием, а именно:

     	1. ^слово - удаление первого совпадения в тексте.
     	2. ^10слово - удаление первых десяти совпадений в тексте.
     	3. #слово - удаление последнего совпадения в тексте.
     	4. #10слово - удаление последних 10 совпадений в тексте.
     	5. слово - удаление всех совпадений.

    Каждое условия задается отдельной строкой в конфигурационном файле.

	2. Файл в кодировке utf-8, в котором содержится текст для обработки.

При разработке программы обязательно нужно использовать структуры, объединения, перечисления. 

В отчете в обязательном порядке должны содержаться:

	1. Блок-схема разработанного алгоритма.
	2. Результаты тестирования на больших файлах с замером времени.
	3. Обосновать какой тип и структура данных для чего были использованы.
	4. Ответы на контрольные вопросы
		1. Что такое структура в языке Си?
		2. Дан программный код
			struct test {
				int i;
				char c;
				int q;
			};
			int main()
			{
				printf("%d", sizeof(struct test));
			}
		   Почему размер типа данных в байтах равен 12?
		3. Что такое перечисление в языке Си?
		4. В чем заключается отличие перечисления от обычной инициализации переменных?

